app/Http/Controllers/AdminValidacionFarmaciaCompleto1Controller.php

select count(*) as aggregate from `cotizacion_convenio` where `estado_solicitud_id` = 11
---
        function countSolicitudes($i){
            $total = DB::table('cotizacion_convenio')->where('estado_solicitud_id', $i)->count();

select count(*) as aggregate from `cotizacion_convenio`
---
        function countSolicitudesTotal(){
            $total = DB::table('cotizacion_convenio')->count();

select count(*) as aggregate from `cotizacion_convenio`
---
        function returnState($value){
            if ($value != 0) {
                return "<h4 style='text-align: left; padding-left: 1rem;'> Solicitudes : ". $_GET['q'] ."   - Cantidad de resultados: " . DB::table('cotizacion_convenio')->whereIn('estado_solicitud_id', $this->getState($_GET['q']))->count() . "</h4>";
            }
            else {
                return  "<h4 style='text-align: left; padding-left: 1rem;'> Solicitudes : VER TODAS   - Cantidad de resultados: " . DB::table('cotizacion_convenio')->count() . "</h4>";

select `name` from `cms_users` where `id` = 1 limit 1
select `id` from `punto_retiro` where `nombre` = 'Administrador General' limit 1
---
	    public function hook_query_index(&$query) {
            $privilegio = CRUDBooster::myPrivilegeId();
            $user = DB::table('cms_users')->where('id',CRUDBooster::myId())->value('name');
            $punto_retiro = DB::table('punto_retiro')->where('nombre',$user)->value('id');