app/Http/Controllers/PDFController.php

    public function printFarmaciaPDF($id){

        $pedido = CotizacionConvenio::where('id', $id)->first();
        $detalles = CotizacionConvenioDetail::where('cotizacion_convenio_id', $id)->get();
---
select * from `cotizacion_convenio` where `id` = '40846' limit 1
select * from `cotizacion_convenio_detail` where `cotizacion_convenio_id` = '40846'